/*******************************************************************************
* ファイル名 scene2D.h
* 作成者 AT-13A-284 秋間雄太
* 作成日 2016/04/20
*******************************************************************************/

/*** インクルードガード開始 ***/
#ifndef _SCENE2D_H_
#define _SCENE2D_H_


/*******************************************************************************
* マクロ定義
*******************************************************************************/

#define VERTEX_NUM (4) /* 描画する頂点の個数 */
#define TRIANGLE_NUM (2) /* 描画する三角形の個数 */

#define POLYGON_X (70) // ポリゴンの描画位置（X座標）
#define POLYGON_Y (60) // ポリゴンの描画位置（Y座標）
#define POLYGON_WIDTH (180) // ポリゴンの幅
#define POLYGON_HEIGHT (330) // ポリゴンの高さ


/*******************************************************************************
* 構造体定義
*******************************************************************************/


/*******************************************************************************
* 2Dポリゴンクラス
*******************************************************************************/

class CScene2D : public CScene{
private:
	LPDIRECT3DVERTEXBUFFER9 m_VertexBuffer; // 頂点バッファへのポインタ
	LPDIRECT3DTEXTURE9 m_TexturePolygon; // テクスチャへのポインタ

public:
	CScene2D(int priority = 3, OBJTYPE objType = OBJTYPE_NONE); // コンストラクタ
	~CScene2D( ); // デストラクタ

	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CScene2D *Create(void); // 必要に応じて初期位置や角度等の引数を
};


#endif
/*** インクルードガード終了 ***/